Revit 2026 API

# SplineFailures Properties

---

The BuiltInFailuresSplineFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotCreateSpline | Can't make Spline. |
|  | ClosedSpline | Closed or self-intersecting splines are not allowed. |

#### Reference

BuiltInFailuresSplineFailures Class

Autodesk.Revit.DB Namespace